### Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # Missing values represented as nan

In [5]:
df = pd.DataFrame(d) # pass in the dictionary

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
# Dropping missing values using 'na()' method
# Passing 'na()' method alone will drop entire columns even with a single missing data
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1) # will drop any column with a null value. In our case, only col C will be left

   C
0  1
1  2
2  3

In [10]:
# Specifying a threshold 
df.dropna(thresh=2) # Will keep row 1 cos it has only 1 NaN value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

<img src="files/thresh.png">

In [12]:
# Replacing missing values using 'fillna()' method
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

<img src="files/fill.png">

In [14]:
df.fillna(value='Amazon')

        A       B  C
0       1       5  1
1       2  Amazon  2
2  Amazon  Amazon  3

In [15]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64